In [1]:
import os
import pandas as pd

## Reading the data in the CSV file
- The dataset is in 6 parts, each corresponding to a month in 2014
- All individual CSV files have been extracted from the zip file downloaded from kaggle

In [2]:
os.chdir('DATA') # Change working directory to DATA
april = pd.read_csv('uber-raw-data-apr14.csv')
may = pd.read_csv('uber-raw-data-may14.csv')
june = pd.read_csv('uber-raw-data-jun14.csv')
july = pd.read_csv('uber-raw-data-jul14.csv')
aug = pd.read_csv('uber-raw-data-aug14.csv')
sep = pd.read_csv('uber-raw-data-sep14.csv')

## Combining all the datasets into one
- Since we don't need data individually for each month, we will combine all into one dataset

In [3]:
dataset = april.append(may).append(june).append(july).append(aug).append(sep)

In [4]:
dataset.head() # This gives us the schema of the dataset

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

## Now we convert Date/Time from string to date object (pandas)

In [5]:
dataset.Timestamp = pd.to_datetime(dataset['Date/Time'], format='%m/%d/%Y %H:%M:%S')

C:\Users\gupta\AppData\Local\Temp/ipykernel_5484/1429430449.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  dataset.Timestamp = pd.to_datetime(dataset['Date/Time'], format='%m/%d/%Y %H:%M:%S')

## Separating the Date/Time into its constituent attributes
We will probably need the time of day and day of week data the most for drawing insights from the data

In [6]:
dataset['Month'] = dataset.Timestamp.dt.month # Month Number
dataset['Day'] = dataset.Timestamp.dt.day # Day of the month
dataset['Day-of-week'] = dataset.Timestamp.dt.day_name() # Day of the week in string form
dataset['Day-of-week-num'] = dataset.Timestamp.dt.dayofweek # Day of the week in numeric form
dataset['hours'] = dataset.Timestamp.dt.hour # Hour of the day
dataset['minutes'] = dataset.Timestamp.dt.minute # Minute of the hour

In [7]:
dataset.head()

,Date/Time,Lat,Lon,Base,Month,Day,Day-of-week,Day-of-week-num,hours,minutes
0,4/1/2014 0:11:00,40.7690,-73.9549,B02512,4,1,Tuesday,1,0,11
1,4/1/2014 0:17:00,40.7267,-74.0345,B02512,4,1,Tuesday,1,0,17
2,4/1/2014 0:21:00,40.7316,-73.9873,B02512,4,1,Tuesday,1,0,21
3,4/1/2014 0:28:00,40.7588,-73.9776,B02512,4,1,Tuesday,1,0,28
4,4/1/2014 0:33:00,40.7594,-73.9722,B02512,4,1,Tuesday,1,0,33

## Removing redundant columns
Since we have got all the data we need from the Date/Time column, we now assume it is safe to remove it

In [8]:
dataset.drop('Date/Time', inplace=True, axis=1)
# Currently we don't see the use of `Base` attribute either. However, it could be of use
# Therefore it has not been removed.
# TODO: If base attribute is not used by the end of project, remove it here
dataset.head()

,Lat,Lon,Base,Month,Day,Day-of-week,Day-of-week-num,hours,minutes
0,40.7690,-73.9549,B02512,4,1,Tuesday,1,0,11
1,40.7267,-74.0345,B02512,4,1,Tuesday,1,0,17
2,40.7316,-73.9873,B02512,4,1,Tuesday,1,0,21
3,40.7588,-73.9776,B02512,4,1,Tuesday,1,0,28
4,40.7594,-73.9722,B02512,4,1,Tuesday,1,0,33

## Checking for NULL values in the dataset
If any NULL values are found, the we will either impute a value or delete a row in order to get a uniform dataset

In [9]:
dataset.describe(), dataset.shape

(                Lat           Lon         Month           Day  \
 count  4.534327e+06  4.534327e+06  4.534327e+06  4.534327e+06
 mean   4.073926e+01 -7.397302e+01  6.828703e+00  1.594337e+01
 std    3.994991e-02  5.726670e-02  1.703810e+00  8.744902e+00
 min    3.965690e+01 -7.492900e+01  4.000000e+00  1.000000e+00
 25%    4.072110e+01 -7.399650e+01  5.000000e+00  9.000000e+00
 50%    4.074220e+01 -7.398340e+01  7.000000e+00  1.600000e+01
 75%    4.076100e+01 -7.396530e+01  8.000000e+00  2.300000e+01
 max    4.211660e+01 -7.206660e+01  9.000000e+00  3.100000e+01

        Day-of-week-num         hours       minutes
 count     4.534327e+06  4.534327e+06  4.534327e+06
 mean      2.968115e+00  1.421831e+01  2.940071e+01
 std       1.875971e+00  5.958759e+00  1.732238e+01
 min       0.000000e+00  0.000000e+00  0.000000e+00
 25%       1.000000e+00  1.000000e+01  1.400000e+01
 50%       3.000000e+00  1.500000e+01  2.900000e+01
 75%       5.000000e+00  1.900000e+01  4.400000e+01
 max       6.000000e+00  2.300000e+01  5.900000e+01  ,
 (4534327, 9))

There are no NULL values in the dataset. The dataset has `4,534,327 rows` in the dataset

## Dataset is now ready for computation and visualization
- We will now save the dataset in another CSV file

In [10]:
os.chdir('../')
dataset.to_csv('Minor-Project-Dataset.csv', index=False)